CFDSimulationOfFlowInAnElbowUsingOpenFoam/EngineOil(unused)/V=5.3_P=1atm/case1_6C_0-700_WI5/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 5.3 0);

boundaryField
{

    Inlet
    {
        type                fixedValue;
        value               uniform (0 5.3 0); 
    }
    
    Outlet
    {
        type            inletOutlet;
        value           $internalField;
        inletValue      uniform (0 0 0);
    }

    Wall
    {
        type            noSlip;
    }

}

// ************************************************************************* //
